################################################################################
#  GIT ALIAS
################################################################################

# -------------------------------------------------------------------------------
# REPOSITORY
# -------------------------------------------------------------------------------
# Jump: got to git-root folder
alias g-root="cd $(git rev-parse --show-toplevel)"

# My git repository commands
alias g-repo="bash ~/.bin/git/git-repo.sh"

# -------------------------------------------------------------------------------
# LOGS
# -------------------------------------------------------------------------------
# olhe: http://opensource.apple.com/source/Git/Git-19/src/git-htmldocs/pretty-formats.txt
# <hash> <date> <user name> <commit message>
alias gl="bash ~/.bin/git/git-log.sh"

# -------------------------------------------------------------------------------
# STATUS
# -------------------------------------------------------------------------------
# Git status
alias gt='git status'

# My git status commands
alias g-status="bash ~/.bin/git/git-status.sh"

# -------------------------------------------------------------------------------
# COMMIT
# -------------------------------------------------------------------------------
# My git commit commands
alias g-commit="bash ~/.bin/git/git-commit.sh"

# -------------------------------------------------------------------------------
# BRANCHES
# -------------------------------------------------------------------------------
# comando padrão de listar as branchs locais
alias gb="git branch"
alias g-branch="bash ~/.bin/git/git-branch.sh"

# -------------------------------------------------------------------------------
# TAGS
# -------------------------------------------------------------------------------
# My git tags commands
alias g-tag="bash ~/.bin/git/git-tags.sh"
